Revit 2024 API
ReinforcementAbbreviationObjectType Enumeration
 Defines the type of desired reinforcement object for abbreviation tags.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public enum ReinforcementAbbreviationObjectType
Visual Basic
Public Enumeration ReinforcementAbbreviationObjectType
Visual C++
public enum class ReinforcementAbbreviationObjectType
Members
Member name | Description
Area |  Abbreviation tags for Area Reinforcement.
Path |  Abbreviation tags for Path Reinforcement.
See Also
Autodesk.Revit.DB.Structure Namespace